Repository: dev-victorvaz/my-personal-website
Catalog: src/locale/messages.*.xlf
Languages: pt

source: I am this.ageService.getAge() years old, this.collegeStatusService.getCollegeStatus() and I'm very happy to be part of technology area.
pt: Eu tenho this.ageService.getAge() anos, this.collegeStatusService.getCollegeStatus() e eu estou muito feliz em fazer parte da área da tecnologia.

# copyright
source: © 2024 by Victor Vaz
pt: © 2024 por Victor Vaz

# proficient
source: Full-stack Developer
pt: Desenvolvedor Full-stack

# description
source: I am {{getAge()}} years old, {{getCollegeStatus()}} and I'm very happy to be part of technology area.
pt: Eu tenho {{getAge()}} anos, {{getCollegeStatus()}} e eu estou muito feliz em fazer parte da área da tecnologia.

# homeNav
source: Home
pt: Início

# skillsNav
source: Skills
pt: Habilidades

# portfolioNav
source: Portfolio
pt: Portfólio

# contactNav
source: Contact
pt: Contato

# themeNav
source: Theme
pt: Tema

# homeNavMobile
source: Home
pt: Início

# skillsNavMobile
source: Skills
pt: Habilidades

# portfolioNavMobile
source: Portfolio
pt: Portfólio

# contactMobile
source: Contact
pt: Contato

# themeNavMobile
source: Theme
pt: Tema

# darkModeNav
source: Dark
pt: Escuro

# lightModeNav
source: Light
pt: Claro

# systemModeNav
source: System
pt: Sistema

source: studying Information Systems at UNA (currently periodth)
pt: estou estudando Sistemas de Informação na UNA (atualmente no period período)

source: I have a degree in Information System from UNA
pt: tenho graduação em sistemas de informação na UNA

# contactDescription
source: You can reach me through my email or social medias or sending a message directly using the form below.<br><a href="mailto:contact@victorvaz.com" class="contact-email">contact@victorvaz.com</a>
pt: Você pode entrar em contato comigo atraves do meu email ou pelas mídias sociais.<br><a href="mailto:contact@victorvaz.com" class="contact-email">contact@victorvaz.com</a>

# contactTitleLabel
source: Title
pt: Título

# contactTitleInput
source: Ex. Good morning, Victor
pt: Ex. Bom dia, Victor

# contactTextLabel
source: Leave your message
pt: Deixe sua mensagem

# contactTextInput
source: Ex. I contacted to...
pt: Ex. Estou entrando em contato para...

# contactSendButton
source: Send
pt: Enviar

# homeDescription
source: Get to know me more through YouTube Shorts on my channel:
pt: Conheça-me mais através dos YouTUbe Shorts em meu canal:

source: Page not found.
pt: Página não encontrada

# portfolioDescription
source: Have a look at my repositories in the link below: <br><a href="https://github.com/dev-victorvaz" target="_blank">github.com/dev-victorvaz</a>
pt: Dê uma olhada nos meus repositórios atravéz do link abaixo: <br><a href="https://github.com/dev-victorvaz" target="_blank">github.com/dev-victorvaz</a>

# projectEGrejaTitle
source: Project E-greja
pt: Projeto E-greja

# firstEGrejaExplanation
source: This project was done at UniBH using Angular and Firebase and the project has home, weekly agenda, members, dashboard and login pages, take a look:
pt: Esse projeto foi feito na UniBH utilizando Angular e Firebase e o projeto conta com páginas de início, agenda semanal, membros, dashboard e login, dê uma olhada:

# secondEGrejaExplanation
source: You can access the website via the link below:
pt: Você pode acessar o website através do link abaixo:

# thirdEGrejaExplanation
source: Access de source code via the link below:
pt: Acesse o código-fonte através do link abaixo:

# projectBrazilsFlagTitle
source: Brazil's Flag
pt: Bandeira do Brasil

source: Here is a project where I designed the Brazilian flag using just HTML and CSS. <br> See the details in: <a href="https://github.com/dev-victorvaz/brazilsflag" target="_blank">github.com/dev-victorvaz/brazilsflag</a>
pt: Aqui está um projeto onde desenhei a bandeira do Brasil usando apenas HTML e CSS. <br> See the details in: <a href="https://github.com/dev-victorvaz/brazilsflag" target="_blank">github.com/dev-victorvaz/brazilsflag</a>

# skillsDescription
source: These are my skills:
pt: Essas são minhas habilidades:

# angularProficiency
source: Intermediary
pt: Intermediário

# angularContent
source: <p><br> I learned Angular at my college in the 4th period. I did some college work and started some projects with him. </p>
pt: <p><br> Aprendi Angular na minha faculdade no 4º período. Fiz alguns trabalhos de faculdade e comecei alguns projetos com ele. </p>

# angularCertificate
source: CERTIFICATE
pt: CERTIFICADO

# skillsProgrammingLanguageTitle
source: Programming languages:
pt: Linguagens de promação:

# javaProficiency
source: Basic
pt: Básico

# javaContent
source: <p><br> I learned Java in the 2th period of college and used it in the 4th as well. I did a lot of exercises with Java. </p>
pt: <p><br> Aprendi Java no 2º período da faculdade e usei no 4º também. Fiz muitos exercícios com Java. </p>

# javaCertificate
source: CERTIFICATE
pt: CERTIFICADO

# sqlProficiency
source: Intermediary
pt: Intermediário

# sqlContent
source: <p><br> I used SQL in the 2th and 5th period of college. Doing various exercises and a college assignment. </p>
pt: <p><br> Utilizei SQL no 2º e 5º período da faculdade. Fazendo vários exercícios e um trabalho de faculdade. </p>

# sqlCertificate
source: CERTIFICATE
pt: CERTIFICADO

# skillsTechnologiesTitle
source: Technologies:
pt: Tecnologias:

# azureProficiency
source: Basic
pt: Básico

# azureContent
source: <p><br> I learned Azure DevOps in the 4th period of college and did a college project with it. </p>
pt: <p><br> Aprendi Azure DevOps no 4º período da faculdade e fiz um projeto de faculdade com ele. </p>
